### SYS6016 - Project Stage II - Charu Rawat (cr4zy) and Elena Gillis (emg3sc)

#### Initial look at the BAC data

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from datetime import datetime

In [2]:
bac = pd.read_csv('bac_0109.csv', index_col= 0)

In [3]:
bac.head()

             timestamp  order_id book_event_type        price  quantity side
0  1483952410007185734    307937               A  22440000000       880    B
1  1483952410007185734    307941               A  22990000000       220    A
2  1483952410014077305    308085               A  23010000000       220    A
3  1483952410014077305    308089               A  22430000000       220    B
4  1483952410019763730    308225               A  22420000000       440    B

In [4]:
bac.tail()

,timestamp,order_id,book_event_type,price,quantity,side
583142,1484010000077704899,206447165,C,24000000000,0,A
583143,1484010000078109674,206446997,C,25000000000,0,A
583144,1484010000079317688,234590049,C,22550000000,0,B
583145,1484010000079744569,234627581,C,22590000000,0,A
583146,1484010000080006912,234592405,C,22600000000,0,A

In [5]:
bac.sample(5)

,timestamp,order_id,book_event_type,price,quantity,side
542594,1483994670482156865,218360061,A,22620000000,1500,A
236980,1483977449396438702,81799449,A,22510000000,200,B
550176,1483994876654050752,220709133,T,22590000000,100,A
87128,1483972678838501147,20110357,A,22440000000,200,A
182539,1483975236376218929,56009689,C,22530000000,0,B

In [6]:
bac.shape

(583147, 6)

In [7]:
bac['book_event_type'].unique()
# add, modity, cancel, trade

array(['A', 'C', 'M', 'T'], dtype=object)

In [8]:
bac['side'].unique()

array(['B', 'A', 'U'], dtype=object)

In [9]:
print('Price min:')
print(bac['price'].min())
print('')
print('Price max:')
print(bac['price'].max())
# prices are multiplied by 10000 to remove decimals

Price min:
100000

Price max:
199999990000000

#### Data Cleaning

In [10]:
# save original bac to df
df = bac

In [11]:
# convert timestamp into datetime format
bac['timestamp'] = pd.to_datetime(bac['timestamp'])

# separate date and time
bac['date'] = bac['timestamp'].dt.date.astype(str)
#bac['time'] = bac['timestamp'].dt.time
# round time to minutes
bac['time'] = bac['timestamp'].apply(lambda dt: 
                                     datetime(dt.year, dt.month, dt.day, dt.hour,dt.minute))
bac['time'] = bac['time'].dt.time
bac.sample(3)

,timestamp,order_id,book_event_type,price,quantity,side,date,time
187335,2017-01-09 15:23:30.485597454,57981705,C,22590000000,0,A,2017-01-09,15:23:00
391400,2017-01-09 18:03:32.526116281,147244721,A,22510000000,200,B,2017-01-09,18:03:00
431891,2017-01-09 18:54:30.877557724,167977709,C,22620000000,0,B,2017-01-09,18:54:00

In [12]:
# count number of instances for each day
bac.groupby('date').size()

date
2017-01-09    583027
2017-01-10       120
dtype: int64

In [13]:
# only keep data from January 3 to see activity distribution in a day
bac_Jan9 = bac[bac['date'] == '2017-01-09']
bac_Jan9.sample(3)

,timestamp,order_id,book_event_type,price,quantity,side,date,time
457947,2017-01-09 19:23:17.230072848,180265437,A,22620000000,1000,A,2017-01-09,19:23:00
106424,2017-01-09 14:44:04.919998988,26408869,C,22510000000,0,A,2017-01-09,14:44:00
460292,2017-01-09 19:25:46.824617668,181286321,C,22610000000,0,B,2017-01-09,19:25:00

In [14]:
# find time range for January 3
print('Start time:')
print(bac_Jan9['time'].min())
print('')
print('End time:')
print(bac_Jan9['time'].max())

Start time:
09:00:00

End time:
23:59:00

In [15]:
#price range for January 3
print('Price min:')
print(bac_Jan9['price'].min())
print('')
print('Price max:')
print(bac_Jan9['price'].max())
# prices are multiplied by 10000 to remove decimals

Price min:
100000

Price max:
199999990000000

In [16]:
# count number of instances for book even type
bac_Jan9.groupby('book_event_type').size()

book_event_type
A    269179
C    261655
M     39578
T     12615
dtype: int64

In [17]:
# count number of instances for each side
bac_Jan9.groupby('side').size()

side
A    288585
B    291987
U      2455
dtype: int64

In [18]:
# ask price range for January 3
print('Ask min price:')
print(bac_Jan9['price'][bac_Jan9['side']=='A'].min())
print('')
print('Ask max price:')
print(bac_Jan9['price'][bac_Jan9['side']=='A'].max())
print('')
print('Bid min price:')
print(bac_Jan9['price'][bac_Jan9['side']=='B'].min())
print('')
print('Bid max price:')
print(bac_Jan9['price'][bac_Jan9['side']=='B'].max())
# prices are multiplied by 10000 to remove decimals

Ask min price:
22410000000

Ask max price:
199999990000000

Bid min price:
100000

Bid max price:
22700000000

In [19]:
# ?? only look at prices trade trade?
bac_Jan9_t = bac_Jan9[bac_Jan9['book_event_type'] == 'T']
bac_Jan9_t.head(3)

,timestamp,order_id,book_event_type,price,quantity,side,date,time
2099,2017-01-09 09:21:52.603757351,0,T,22670000000,1,U,2017-01-09,09:21:00
12535,2017-01-09 10:23:46.044451661,0,T,22670000000,99,U,2017-01-09,10:23:00
12536,2017-01-09 10:23:46.044451661,0,T,22670000000,1,U,2017-01-09,10:23:00

In [20]:
#???only keep ask and bid prices (remove unknown)
bac_Jan9 = bac_Jan9[bac_Jan9['side']!='U']
bac_Jan9.head()

,timestamp,order_id,book_event_type,price,quantity,side,date,time
0,2017-01-09 09:00:10.007185734,307937,A,22440000000,880,B,2017-01-09,09:00:00
1,2017-01-09 09:00:10.007185734,307941,A,22990000000,220,A,2017-01-09,09:00:00
2,2017-01-09 09:00:10.014077305,308085,A,23010000000,220,A,2017-01-09,09:00:00
3,2017-01-09 09:00:10.014077305,308089,A,22430000000,220,B,2017-01-09,09:00:00
4,2017-01-09 09:00:10.019763730,308225,A,22420000000,440,B,2017-01-09,09:00:00

In [21]:
#??? only retain max prices for each order id
maxprice = pd.DataFrame(bac_Jan9.groupby(['order_id','side'])['price'].max())
maxprice = maxprice.reset_index()
maxprice.head()

   order_id side        price
0    175193    B  20500000000
1    178433    B  22100000000
2    307937    B  22440000000
3    307941    A  22990000000
4    308085    A  23010000000

In [22]:
# create a dataframe with ask prices for each order id
maxprice_A = pd.DataFrame(maxprice[maxprice['side']=='A'])
maxprice_A['ask_price'] = maxprice_A['price']
maxprice_A = maxprice_A.reset_index()
maxprice_A.drop(['index','side','price'], axis=1, inplace=True)
maxprice_A.head(3)

   order_id    ask_price
0    307941  22990000000
1    308085  23010000000
2    308229  23060000000

In [23]:
# create a dataframe with bid prices for each order id
maxprice_B = pd.DataFrame(maxprice[maxprice['side']=='B'])
maxprice_B['bid_price'] = maxprice_B['price']
maxprice_B = maxprice_B.reset_index()
maxprice_B.drop(['index','side','price'], axis=1, inplace=True)
maxprice_B.head(3)

   order_id    bid_price
0    175193  20500000000
1    178433  22100000000
2    307937  22440000000

In [26]:
# create a dataframe with ask and bid price for each order id

# inner join both dataframes on time 
# to retain only timestamps that have both ask and bid prices
maxprices_AB = pd.merge(maxprice_A, maxprice_B, on = 'order_id', how='inner')
print(maxprices_AB.shape)
print(maxprices_AB.head())

(0, 3)
Empty DataFrame
Columns: [order_id, ask_price, bid_price]
Index: []

In [25]:

plt.plot(bac_Jan3_t['time'][bac_Jan3_t['side']=='A'],
         bac_Jan3_t['price'][bac_Jan3_t['side']=='A'],
         'b', label='Ask prices')
plt.plot(bac_Jan3_t['time'][bac_Jan3_t['side']=='B'],
         bac_Jan3_t['price'][bac_Jan3_t['side']=='B'],
         'r', label = 'Bid prices')
plt.legend()
plt.show()

NameError: name 'bac_Jan3_t' is not defined

In [ ]:
bac_Jan3_t.groupby('time').size()